:PROPERTIES:
:ID:       62f037c8-f324-4f18-8cc9-c7cd233ab48c
:END:
#+TITLE: Git: Using git-stack with worktrees
#+CATEGORY: slips
#+TAGS:

*** Getting paths

You may like some consistent paths for scripts or for sanity check

+ git rev-parse --git-path config.worktree :: find the config path for the
  current worktree (only for =core.worktreeConfig=)
+ git rev-parse --git-path config :: get the path to the =main-worktree= config
+ git rev-parse --git-path HEAD :: returns the path to =HEAD= for the current
  worktree.

Though my zettelkasten project doesn't use worktrees, this returns the relative
path to the specified ref:

#+begin_src shell :results output
echo HEAD
git rev-parse --git-path HEAD
echo
echo contains:
cat "$(git rev-parse --git-path HEAD)"
echo
echo refs/heads/master
git rev-parse --git-path refs/heads/master
echo
echo contains:
cat "$(git rev-parse --git-path refs/heads/master)"
#+end_src

#+RESULTS:
#+begin_example
HEAD
../.git/HEAD

contains:
ref: refs/heads/master

refs/heads/master
../.git/refs/heads/master

contains:
449c3bad1ad24bf1861cbe08a6eb3caf76c1d042
#+end_example

